{
  "name": "K. P. Sharma Oli",
  "pages": {
    "en": {
      "content": "Khadga Prasad Sharma Oli (born 22 February 1952), commonly known as K. P. Sharma Oli or simply K. P. Oli, is a Nepalese politician who thrice served as the 38th prime minister of Nepal from 2015 to 2016, 2018 to 2021, and 2024 to 2025. He has served as the chairman of the Communist Party of Nepal (Unified Marxist–Leninist) since 2014. Oli has been Member of Parliament for Jhapa 5 since 2017. He previously served as an MP for Jhapa 6, Jhapa 2, and Jhapa 7.\nOli opposed the 2015 blockade of Nepal by the Madhesis. He strengthened relations with China as an alternative to Nepal's traditionally close trade ties with India. Oli's tenure in office has been controversial for frequent use of tongue-in-cheek remarks, hostility towards critics and the media, and accusations of fostering cronyism and corruption. On 9 September 2025, he resigned as prime minister in the wake of the Gen Z protests.\n\n\n== Early life and education ==\nK.P. Sharma Oli was born on 22 February 1952 in Iwa in Tehrathum. His father, Mohan Prasad Oli, was a Brahmin farmer with limited education. His mother, Madhumaya Oli, died from smallpox when he was four. He had a younger brother and three younger sisters from his father's second marriage. Oli completed his primary education at the nearby Pranami Middle School. His family moved to Surunga, Jhapa in 1958 but following floods in the Kankai River, they were left landless and Oli moved in with his grandparents. His family then migrated to Garamani, Jhapa in 1962. He completed his SLC exam from Adarsha Secondary School in 1970. While in Jhapa, Oli was influenced by the anti-Panchayat and Naxalbari movements. He credits his distant uncle Ramnath Dahal for his communist inclination.\n\n\n== Early political career ==\n\n\n=== Panchayat era (1970–1991) ===\nAfter he turned eighteen in 1970, Oli became a member of his local chapter of a splinter group of the Communist Party of Nepal. He was arrested in the same year for his involvement in subversive politics. His group later joined the district committee of the Communist Party of Nepal (Manmohan). After the party split in 1972, he became the organizing secretary of a Coordination Committee for the Jhapa rebellion after former secretary Radha Krishna Mainali contracted tuberculosis. Oli, Mohan Chandra Adhikari and Ram Nath Dahal advocated for organizational expansion and public mobilization arguing that authorities would crack down on them for any violent activities. A majority of the committee favored an armed struggle however and in February 1973 he was removed as secretary and had his membership stripped off by hardliners within the committee led by Chandra Prakash Mainali. The next month, Ramnath Dahal was killed by the Panchayat administration.\nFollowing his removal as secretary, Oli went into hiding in Biratnagar. He then got into contact with Mohan Chandra who was in Kanpur, India at the time. In October 1973 upon his return to Nepal, he was arrested in Rautahat and was imprisoned until 1987. He was first kept in Gaur prison but was moved around before being sent to the Central Jail in Golghar. There he was kept in solitary confinement for four years. Oli was made a central committee member of the Madan Bhandari-led CPN (Marxist–Leninist) while in jail and after his release in 1987 became involved in party activities. He was appointed the Lumbini Zonal chief for the United Left Front in 1989.\n\n\n=== Parliamentary politics (1991–2015) ===\nAfter CPN (Marxist–Leninist) merged with CPN (Marxist) to form the CPN (Unified Marxist–Leninist) in 1991, Oli became a founding central committee member of the new party. Later that year he became the founding chairman of the Democratic National Youth Federation. In 1992, he was elected as a standing committee member of the party and was appointed as the chief of the party's publicity department. In the 1991 election, Oli was elected from Jhapa 6. Oli supported party general secretary Madan Bhandari's proposal of People's Multiparty Democracy as the party line in the fifth party congress in 1993. After Bhandari's death on 16 May 1993, a commission to conduct an investigation was made by prime minister Girija Prasad Koirala under the leadership of former supreme court justice Prachanda Raj Anil. The UML labeled the party as pro-Congress and formed their own commission headed by Oli. The report by Oli claimed that the crash was an assassination, while the government commission claimed that the incident was an accident.\nHe was reelected in the 1994 election from Jhapa 6 and became Home Minister in the minority government of Man Mohan Adhikari. Oli was a coordinator of the party's Mahakali treaty study team and played a key role in the treaty's endorsement in the parliament. He supported general secretary Madhav Kumar Nepal at the party's sixth national congress which was boycotted by members led by deputy general secretary Bam Dev Gautam. The boycotting members were suspended by the party and they broke off and reconstituted the CPN (Marxist–Leninist) citing their opposition to the treaty and their unfair treatment within the party. He was reelected again in the 1999 election from Jhapa 2 and Jhapa 6, the latter of which he vacated. In the party's seventh congress in February 2003, Oli put forth a proposal to democratize the party structure and proposed a structure with a chairman and a general secretary. After he was outnumbered in the congress, he withdrew his proposal.\n\nFollowing the royal coup by King Gyanendra in 2005, he was put under house arrest. Following the 2006 revolution, Oli was appointed as deputy prime minister and foreign minister in Girija Prasad Koirala's interim cabinet. He was also made chair of a cabinet committee to implement the High Level Probe Commission report which investigated abuses of state power and funds since the royal coup. Oli lost in the 2008 Constituent Assembly election in Jhapa 7. At the party's eighth general convention in 2009, his previous proposal for organizational changes was accepted. He was also reelected to the central committee by the congress but lost his bid for party chair to Jhala Nath Khanal.\n\n\n== Premiership (2015–2025) ==\nIn the 2013 Constituent Assembly election, Oli was elected from Jhapa 7. He also became the parliamentary party leader, defeating Khanal in the contest. Oli again challenged for the party leadership at the ninth general convention in July 2015. He defeated former general secretary Madhav Kumar Nepal and was elected as party chair.\n\n\n=== First term (October 2015–July 2016) ===\n\nFollowing the promulgation of the new constitution, Oli was elected as Prime Minister in a parliamentary vote on 11 October 2015, receiving 338 votes out of 597 members in the Legislature Parliament. His candidacy was supported by the UCPN (Maoist), Rastriya Prajatantra Party Nepal, Madheshi Jana Adhikar Forum, Nepal (Loktantrik) and 13 other small parties. He was sworn in on 12 October.\nHis appointment came at the time of protests in the southern plains demanding revisions to the constitution and a blockade imposed by India. Amid deteriorating relations with India, his cabinet recalled Nepal's ambassador to India, Dip Kumar Upadhaya following differences with the cabinet. On 20 March, he went on a state visit to China where the two countries signed trade and transit treaties.\nHe resigned on 24 July 2016, after losing the support of his coalition partners. The main coalition partner CPN (Maoist Centre) and the opposition Nepali Congress had registered a no-confidence motion against his government on 14 July 2016.\n\n\n=== Second and third terms (February 2018–August 2021) ===\n\nIn the 2017 election, the alliance between the CPN (UML) and CPN (Maoist Centre) gained a majority in the House of Representatives. Oli was elected from Jhapa 5 with a majority of over 28,000 votes. He was unanimously elected as the leader of the parliamentary party on 15 February 2018.\nHe was appointed prime minister for a second time on 15 February 2018 with the support of CPN (Maoist Centre). He passed the floor test on 11 March with 208 of 268 votes in the 275-member House of Representatives. Following the merger of the two coalition partners to form the Nepal Communist Party, he became co-chair of the new party along with Pushpa Kamal Dahal.\n\nAfter pressure within the party from Madhav Kumar Nepal and other leaders to either give up the party leadership or the premiership, Dahal was made the executive head of the party. He reshuffled his cabinet on 22 November to manage factions within the party. His government also received criticism from leader within the party including Bhim Rawal for their agreement with the United States government for grants under the Millennium Challenge Corporation.\nIn February 2019, Oli claimed that the world is amazed by the supercomputer being built by Nepal. He was referring to a computer that was being built in the Banepa IT Park, which the makers had claimed to be a supercomputer in spite of its lacking computing power.\nIn August 2019, Oli claimed the English word rhinoceros should be replaced by the Nepali word for the animal, Gainda (Nepali: गैँडा, romanized: Gaim̐ḍā), and Mount Everest should be known as Sagarmatha (Nepali: सगरमाथा, romanized: Sagarmāthā) by everyone. He said, \"...Do you know what [a] gaida [is]? You people know [a] gaida as [a] rhino. But rhinos are not rhinos, they are gaida. I request you to remember this word—gaida...\".\nHis handling of the COVID-19 pandemic was criticized within the party. Party members were critical of an agreement with a private company in China to purchase medical equipment, and unbeknownst to cabinet members assigning the responsibility to purchase medical equipment to the Nepali Army. The government's late response in evacuating Nepalese citizens was also criticized. He also received criticism for suggesting that the rising number of coronavirus cases were from individuals breaking the lockdown, especially those sneaking into Nepal from India. He also claimed that the corona is similar to the flu and that one should sneeze and drink hot water to drive the virus away.\n\nIn May 2020, the Oli government unveiled new maps of the country including the disputed territories of Kalapani, Lipulekh and Limpiyadhura in response to the inauguration of a road across the Lipulekh Pass by India, which led to a \"cartographic war\" between the two countries. A constitutional amendment bill to amend the official map and emblem of the country passed unanimously.\nFollowing calls within the party to resign, Oli reshuffled his cabinet again in October 2020 but was admonished for not consulting the party. Dahal presented a political document at a party secretariat meeting that accused K.P. Sharma Oli of not following the party's directions, unilaterally leading the government and turning a blind eye towards corruption. In response, Oli attacked Dahal for not letting him run the government, promoting factionalism and nepotism as well as not letting victims of the Nepalese Civil War get justice.\nOn 20 December 2020, K.P. Sharma Oli called on President Bidhya Devi Bhandari to dissolve the House of Representatives and call for fresh elections. In an address to the nation, Oli said he dissolved the house after the party had not let him work as prime minister and that a no-confidence motion was being prepared against him from within the party. The decision was met with criticism from within the party and seven ministers close to the Dahal–Nepal faction in his cabinet resigned in protest. On 23 February 2021, a constitutional bench led by Chief Justice Cholendra Shumsher JB Rana declared the dissolution unconstitutional, and reinstated the House to meet within 13 days. Oli respected the verdict and convened parliament on 7 March.\nOn 7 March 2021, the Supreme Court ruled to award the Nepal Communist Party to Rishiram Kattel after he challenged the Election Commission's ruling of providing the name of his party to the NCP formed after the 2018 merger. The verdict dissolved the ruling party jointly led by Oli and Dahal, reviving the former CPN (UML) and CPN (Maoist Centre) parties. This reduced Oli's government back to a coalition, exacerbating political tensions. The CPN (Maoist Centre) recalled its ministers on 13 March 2021 and withdrew its support from the Oli government on 5 May 2021, turning it into a minority government.\nOn 10 May 2021, Oli failed a vote of confidence with 93 of 232 in the House of Representatives, 43 below the 136 majority. He then became a minority Prime Minister on 13 May 2021, when no opposition party formed a majority or claimed it in time. A cabinet meeting chaired by Oli recommended the president to dissolve the House of Representatives on 22 May 2021 after members of his party led by former prime ministers Madhav Kumar Nepal and Jhala Nath Khanal supported Nepali Congress leader Sher Bahadur Deuba as the next prime minister. On 12 July 2021, the constitutional bench of the Supreme Court formed to hear the opposition's writs against the dissolution. It declared the dissolution unconstitutional and ordered the appointment of Deuba as prime minister within 28 hours. After Nepal and Khanal were suspended by the party for disobeying party orders the party split in August the former party leaders forming the Communist Party of Nepal (Unified Socialist). Oli was re-elected party chair in the 10th general convention of the CPN (UML) in November 2021 defeating Bhim Rawal in the leadership election.\n\n\n=== Fourth term (July 2024–September 2025) ===\n\nIn the 2022 general election, his party became the second-largest party in the House of Representatives. Oli was reelected from Jhapa 5 with a majority of over 29,000 votes. After power-sharing talks broke down inside the ruling alliance, Oli and Dahal brokered a deal, backing Dahal's bid as prime minister. The UML withdrew from the coalition government ahead of the presidential election in March 2023, but joined hands with Dahal again in March 2024.\nFollowing disagreements with the prime minister and other coalition partners about the annual budget and citing the need for a stable government of national consensus, Oli and Nepali Congress' Deuba agreed on 1 July 2024 to form a rotational government with the two party chairs serving equal time as prime minister. CPN (UML) withdrew its support from the Dahal government, and following a failed a motion of confidence for Dahal in the House on 12 July, Oli was appointed prime minister for a fourth stint on 14 July as part of a coalition with the Nepali Congress, and sworn in the following day.\n\n\n=== Resignation ===\nAfter widespread protests that started after a government-imposed social media ban and as part of the wider movement against corruption, Oli resigned as prime minister on 9 September 2025. He along with other ministers sought shelter at an army barrack in Shivapuri.\n\n\n== Political positions ==\nOli credits his distant uncle Ramnath Dahal for his communist beliefs. As a student in Jhapa at the time, he was influenced by the Naxalite insurgency in West Bengal, India. He had not studied Marxism but had followed the line of Cultural Revolution in his earlier days. He later claimed that it was a \"mistaken path\".\nOli was regularly in conflict with \"hardliners\" that advocated for armed struggle against the Panchayat administration. He has been critical of the Maoists for the loss of life during the Civil War.\n\n\n=== Relations with India ===\n\nWhile organizing the Jhapa rebellion, organizers hired two Naxalite guerrillas to train their members. Oli supported Mohan Chandra Adhikari's opinion that their presence was part of India's imperialist ambitions in the region.\nOli played an important role in getting parliamentary support for the Mahakali treaty that was to be signed with India. The treaty was a reason cited for causing a split in the party and it led to Oli being seen as a pro-India leader.\nDuring his first tenure in 2015, he pushed for closer ties with China following the blockade by India. In his second tenure his government brought in amendments to the constitution which added the disputed territories of Kalapani, Lipulekh and Limpiyadhura to the official map of the country in response to the inauguration of a road across Lipulekh by India.\nDuring the COVID-19 pandemic in Nepal, Oli had lashed out at India, saying that the \"Indian virus\" was more dangerous than the \"Chinese or Italian virus\" and made light of the Indian national emblem. He said this during an address to the parliament where he blamed the rising number of coronavirus cases on individuals violating the nationwide lockdown, especially those sneaking into Nepal from India, claiming that \"people coming from India through illegal channels are spreading the virus in the country.\", which sparked a round of media attention in India.\nWhile addressing a function celebrating the 207th birth anniversary of poet Bhanubhakta Acharya on July 2020, Oli said Lord Rama was born in Nepal and India had created a fake Ayodhya. He claimed Thori, a place near Birgunj in southern Nepal, to be the birthplace of Rama and it was impossible for Rama to reach Janakpur in eastern Nepal to marry Sita from Ayodhya in India. He later launched an investigation into this matter, asking officials in the region to research the whereabouts of Ayodhyapuri. He also claimed to have found strong evidences of the real Ayodhya, supposedly including the ruins of Someshwar Gadhi and Valmiki Ashram, both of whom are associated with Lord Rama.\nOn the occasion of International Day of Yoga on 21 June 2021, Oli claimed that yoga originated in Uttarakhand and Nepal in particular. According to him, India as a country did not exist at the time when yogic science was founded. This caused backlash from Nepali and Indian social media.\n\n\n=== Federalism and Republicanism ===\nAfter the dissolution of the parliament in 2003, there were claims from some that Oli had dealings with the palace . He had commented that turning Nepal into a republic would be like \"making for America in a bullock cart\". Oli also defied party whip and was not present when the interim legislature declared Nepal as a republic.\nOli has been seen as favoring centralization. During his second term as prime minister he centralized more executive power into his post. He has also been seen as unwilling to let provincial and local governments function autonomously.\n\n\n== Electoral history ==\n\n\n== Personal life ==\nOli is married to Radhika Shakya. He met Shakya in 1987 at an event organized by CPN (Marxist–Leninist) for recently released political prisoners in Pulchowk Campus. She was working as a temporary worker for Nepal Rastra Bank at the time, while studying at Patan Campus. Later that year, the two married in a ceremony attended by 20 people.\nHe currently resides in Balkot, Bhaktapur but also has a residence in Damak, Jhapa.\n\n\n=== Health issues ===\nDuring his imprisonment, Oli contracted tuberculosis and he was also suffering from gastric ulcer. At the time of release, he was described to be extremely scrawny. After the 1990 revolution he developed problems in his kidneys. He underwent a kidney transplant in Apollo Hospital, New Delhi in 2007 and had a second transplant in Tribhuvan University Teaching Hospital, Kathmandu in 2020. He was admitted to intensive care where he underwent dialysis for renal disease in November 2019.\n\n\n== Bibliography ==\nSelected speeches of K P Sharma Oli. Kathmandu: Central Office, Communist Party of Nepal – UML. 2016.\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nK. P. Sharma Oli at the CPN UML official website",
      "url": "https://en.wikipedia.org/wiki/K._P._Sharma_Oli",
      "title": "K. P. Sharma Oli",
      "summary": "Khadga Prasad Sharma Oli (born 22 February 1952), commonly known as K. P. Sharma Oli or simply K. P. Oli, is a Nepalese politician who thrice served as the 38th prime minister of Nepal from 2015 to 2016, 2018 to 2021, and 2024 to 2025. He has served as the chairman of the Communist Party of Nepal (Unified Marxist–Leninist) since 2014. Oli has been Member of Parliament for Jhapa 5 since 2017. He previously served as an MP for Jhapa 6, Jhapa 2, and Jhapa 7.\nOli opposed the 2015 blockade of Nepal by the Madhesis. He strengthened relations with China as an alternative to Nepal's traditionally close trade ties with India. Oli's tenure in office has been controversial for frequent use of tongue-in-cheek remarks, hostility towards critics and the media, and accusations of fostering cronyism and corruption. On 9 September 2025, he resigned as prime minister in the wake of the Gen Z protests.\n\n",
      "categories": [
        "1952 births",
        "21st-century prime ministers of Nepal",
        "Articles containing Nepali (macrolanguage)-language text",
        "Articles with short description",
        "Bahun",
        "CS1 French-language sources (fr)",
        "CS1 Nepali-language sources (ne)",
        "Communist Party of Nepal (Marxist–Leninist) (1998) politicians",
        "Communist Party of Nepal (Pushpa Lal) politicians",
        "Communist Party of Nepal (Unified Marxist–Leninist) politicians",
        "Government ministers of Nepal",
        "Khas people",
        "Leaders of the opposition (Nepal)",
        "Living people",
        "Ministers of foreign affairs of Nepal",
        "Nepal Communist Party (NCP) politicians",
        "Nepal MPs 1991–1994",
        "Nepal MPs 1994–1999",
        "Nepal MPs 1999–2002",
        "Nepal MPs 2017–2022",
        "Nepal MPs 2022–2025",
        "Pages including recorded pronunciations",
        "Pages using the Phonos extension",
        "Pages with Nepali (macrolanguage) IPA",
        "People from Tehrathum District",
        "Short description is different from Wikidata",
        "Use dmy dates from September 2025",
        "Wikipedia temporarily semi-protected biographies of living people"
      ],
      "links": [
        "10th general convention of Communist Party of Nepal (Unified Marxist–Leninist)",
        "1951 Nepalese revolution",
        "1990 Nepalese revolution",
        "1991 Nepalese general election",
        "1994 Nepalese general election",
        "1999 Nepalese general election",
        "1st Nepalese Constituent Assembly",
        "2006 Nepalese revolution",
        "2008 Nepalese Constituent Assembly election",
        "2013 Nepalese Constituent Assembly election",
        "2015 Nepal blockade",
        "2017 Nepalese general election",
        "2022 Nepalese general election",
        "2025 Nepalese Gen Z protests",
        "2025 Tianjin SCO summit",
        "2nd Nepalese Constituent Assembly",
        "Amik Sherchan",
        "Apollo Hospitals",
        "Ayodhya (Ramayana)",
        "Ayodhyapuri",
        "Baburam Bhattarai",
        "Balkot, Bhaktapur",
        "Bam Bahadur Kunwar",
        "Bam Dev Gautam",
        "Bamdev Gautam",
        "Basanta Kumar Nemwang",
        "Bhanubhakta Acharya",
        "Bharat Mohan Adhikari",
        "Bhim Rawal",
        "Bhim Shumsher Jung Bahadur Rana",
        "Bhimsen Thapa",
        "Bidya Devi Bhandari",
        "Bir Shumsher Jung Bahadur Rana",
        "Biratnagar",
        "Birgunj",
        "Bishnu Prasad Paudel",
        "Bishweshwar Prasad Koirala",
        "Bishwodip Lingden Limbu",
        "Brahmin",
        "C. P. Mainali",
        "COVID-19 pandemic in Nepal",
        "CPN (Maoist Centre)",
        "CPN (UML)",
        "Chandra Prakash Mainali",
        "Chandra Shumsher Jung Bahadur Rana",
        "Chautariya Puskhar Shah",
        "China",
        "China–Nepal relations",
        "Cholendra Shumsher JB Rana",
        "Communist Party of Nepal"
      ],
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/d/d2/En-us-K.p._Sharma_Oli_from_Nepal_pronunciation_%28Voice_of_America%29.ogg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9b/Flag_of_Nepal.svg",
        "https://upload.wikimedia.org/wikipedia/commons/c/cd/KP_Oli.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/3/34/KP_Oli_Signature.svg",
        "https://upload.wikimedia.org/wikipedia/commons/6/60/KP_Oli_UML_Parliamentary_Party_Meeting_1996_%28cropped%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/dc/President_Putin_meeting_PM_of_Nepal_Oli_at_2025_SCO_Summit_%2802%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9c/Shri_K.P._Sharma_Oli%2C_in_New_Delhi_on_February_22%2C_2016.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/8f/The_Prime_Minister%2C_Shri_Narendra_Modi_with_the_Prime_Minister_of_Nepal%2C_Shri_K.P._Sharma_Oli%2C_at_Janakpur%2C_Nepal_on_May_11%2C_2018_%283%29.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/a/a3/The_Prime_Minister%2C_Shri_Narendra_Modi_with_the_Prime_Minister_of_Nepal%2C_Shri_K.P._Sharma_Oli%2C_in_New_Delhi_on_February_20%2C_2016.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/dd/The_Prime_Minister_of_Nepal%2C_Shri_KP_Sharma_Oli_at_Bangkok%2C_in_Thailand_on_April_04%2C_2025_%28cropped%29.jpg"
      ],
      "sections": [
        {
          "heading": "Early life and education",
          "content": "K.P. Sharma Oli was born on 22 February 1952 in Iwa in Tehrathum. His father, Mohan Prasad Oli, was a Brahmin farmer with limited education. His mother, Madhumaya Oli, died from smallpox when he was four. He had a younger brother and three younger sisters from his father's second marriage. Oli completed his primary education at the nearby Pranami Middle School. His family moved to Surunga, Jhapa in 1958 but following floods in the Kankai River, they were left landless and Oli moved in with his grandparents. His family then migrated to Garamani, Jhapa in 1962. He completed his SLC exam from Adarsha Secondary School in 1970. While in Jhapa, Oli was influenced by the anti-Panchayat and Naxalbari movements. He credits his distant uncle Ramnath Dahal for his communist inclination."
        },
        {
          "heading": "Early political career",
          "content": ""
        },
        {
          "heading": "Panchayat era (1970–1991)",
          "content": "After he turned eighteen in 1970, Oli became a member of his local chapter of a splinter group of the Communist Party of Nepal. He was arrested in the same year for his involvement in subversive politics. His group later joined the district committee of the Communist Party of Nepal (Manmohan). After the party split in 1972, he became the organizing secretary of a Coordination Committee for the Jhapa rebellion after former secretary Radha Krishna Mainali contracted tuberculosis. Oli, Mohan Chandra Adhikari and Ram Nath Dahal advocated for organizational expansion and public mobilization arguing that authorities would crack down on them for any violent activities. A majority of the committee favored an armed struggle however and in February 1973 he was removed as secretary and had his membership stripped off by hardliners within the committee led by Chandra Prakash Mainali. The next month, Ramnath Dahal was killed by the Panchayat administration.\nFollowing his removal as secretary, Oli went into hiding in Biratnagar. He then got into contact with Mohan Chandra who was in Kanpur, India at the time. In October 1973 upon his return to Nepal, he was arrested in Rautahat and was imprisoned until 1987. He was first kept in Gaur prison but was moved around before being sent to the Central Jail in Golghar. There he was kept in solitary confinement for four years. Oli was made a central committee member of the Madan Bhandari-led CPN (Marxist–Leninist) while in jail and after his release in 1987 became involved in party activities. He was appointed the Lumbini Zonal chief for the United Left Front in 1989."
        },
        {
          "heading": "Parliamentary politics (1991–2015)",
          "content": "After CPN (Marxist–Leninist) merged with CPN (Marxist) to form the CPN (Unified Marxist–Leninist) in 1991, Oli became a founding central committee member of the new party. Later that year he became the founding chairman of the Democratic National Youth Federation. In 1992, he was elected as a standing committee member of the party and was appointed as the chief of the party's publicity department. In the 1991 election, Oli was elected from Jhapa 6. Oli supported party general secretary Madan Bhandari's proposal of People's Multiparty Democracy as the party line in the fifth party congress in 1993. After Bhandari's death on 16 May 1993, a commission to conduct an investigation was made by prime minister Girija Prasad Koirala under the leadership of former supreme court justice Prachanda Raj Anil. The UML labeled the party as pro-Congress and formed their own commission headed by Oli. The report by Oli claimed that the crash was an assassination, while the government commission claimed that the incident was an accident.\nHe was reelected in the 1994 election from Jhapa 6 and became Home Minister in the minority government of Man Mohan Adhikari. Oli was a coordinator of the party's Mahakali treaty study team and played a key role in the treaty's endorsement in the parliament. He supported general secretary Madhav Kumar Nepal at the party's sixth national congress which was boycotted by members led by deputy general secretary Bam Dev Gautam. The boycotting members were suspended by the party and they broke off and reconstituted the CPN (Marxist–Leninist) citing their opposition to the treaty and their unfair treatment within the party. He was reelected again in the 1999 election from Jhapa 2 and Jhapa 6, the latter of which he vacated. In the party's seventh congress in February 2003, Oli put forth a proposal to democratize the party structure and proposed a structure with a chairman and a general secretary. After he was outnumbered in the congress, he withdrew his proposal.\n\nFollowing the royal coup by King Gyanendra in 2005, he was put under house arrest. Following the 2006 revolution, Oli was appointed as deputy prime minister and foreign minister in Girija Prasad Koirala's interim cabinet. He was also made chair of a cabinet committee to implement the High Level Probe Commission report which investigated abuses of state power and funds since the royal coup. Oli lost in the 2008 Constituent Assembly election in Jhapa 7. At the party's eighth general convention in 2009, his previous proposal for organizational changes was accepted. He was also reelected to the central committee by the congress but lost his bid for party chair to Jhala Nath Khanal."
        },
        {
          "heading": "Premiership (2015–2025)",
          "content": "In the 2013 Constituent Assembly election, Oli was elected from Jhapa 7. He also became the parliamentary party leader, defeating Khanal in the contest. Oli again challenged for the party leadership at the ninth general convention in July 2015. He defeated former general secretary Madhav Kumar Nepal and was elected as party chair."
        },
        {
          "heading": "First term (October 2015–July 2016)",
          "content": "Following the promulgation of the new constitution, Oli was elected as Prime Minister in a parliamentary vote on 11 October 2015, receiving 338 votes out of 597 members in the Legislature Parliament. His candidacy was supported by the UCPN (Maoist), Rastriya Prajatantra Party Nepal, Madheshi Jana Adhikar Forum, Nepal (Loktantrik) and 13 other small parties. He was sworn in on 12 October.\nHis appointment came at the time of protests in the southern plains demanding revisions to the constitution and a blockade imposed by India. Amid deteriorating relations with India, his cabinet recalled Nepal's ambassador to India, Dip Kumar Upadhaya following differences with the cabinet. On 20 March, he went on a state visit to China where the two countries signed trade and transit treaties.\nHe resigned on 24 July 2016, after losing the support of his coalition partners. The main coalition partner CPN (Maoist Centre) and the opposition Nepali Congress had registered a no-confidence motion against his government on 14 July 2016."
        },
        {
          "heading": "Second and third terms (February 2018–August 2021)",
          "content": "In the 2017 election, the alliance between the CPN (UML) and CPN (Maoist Centre) gained a majority in the House of Representatives. Oli was elected from Jhapa 5 with a majority of over 28,000 votes. He was unanimously elected as the leader of the parliamentary party on 15 February 2018.\nHe was appointed prime minister for a second time on 15 February 2018 with the support of CPN (Maoist Centre). He passed the floor test on 11 March with 208 of 268 votes in the 275-member House of Representatives. Following the merger of the two coalition partners to form the Nepal Communist Party, he became co-chair of the new party along with Pushpa Kamal Dahal.\n\nAfter pressure within the party from Madhav Kumar Nepal and other leaders to either give up the party leadership or the premiership, Dahal was made the executive head of the party. He reshuffled his cabinet on 22 November to manage factions within the party. His government also received criticism from leader within the party including Bhim Rawal for their agreement with the United States government for grants under the Millennium Challenge Corporation.\nIn February 2019, Oli claimed that the world is amazed by the supercomputer being built by Nepal. He was referring to a computer that was being built in the Banepa IT Park, which the makers had claimed to be a supercomputer in spite of its lacking computing power.\nIn August 2019, Oli claimed the English word rhinoceros should be replaced by the Nepali word for the animal, Gainda (Nepali: गैँडा, romanized: Gaim̐ḍā), and Mount Everest should be known as Sagarmatha (Nepali: सगरमाथा, romanized: Sagarmāthā) by everyone. He said, \"...Do you know what [a] gaida [is]? You people know [a] gaida as [a] rhino. But rhinos are not rhinos, they are gaida. I request you to remember this word—gaida...\".\nHis handling of the COVID-19 pandemic was criticized within the party. Party members were critical of an agreement with a private company in China to purchase medical equipment, and unbeknownst to cabinet members assigning the responsibility to purchase medical equipment to the Nepali Army. The government's late response in evacuating Nepalese citizens was also criticized. He also received criticism for suggesting that the rising number of coronavirus cases were from individuals breaking the lockdown, especially those sneaking into Nepal from India. He also claimed that the corona is similar to the flu and that one should sneeze and drink hot water to drive the virus away.\n\nIn May 2020, the Oli government unveiled new maps of the country including the disputed territories of Kalapani, Lipulekh and Limpiyadhura in response to the inauguration of a road across the Lipulekh Pass by India, which led to a \"cartographic war\" between the two countries. A constitutional amendment bill to amend the official map and emblem of the country passed unanimously.\nFollowing calls within the party to resign, Oli reshuffled his cabinet again in October 2020 but was admonished for not consulting the party. Dahal presented a political document at a party secretariat meeting that accused K.P. Sharma Oli of not following the party's directions, unilaterally leading the government and turning a blind eye towards corruption. In response, Oli attacked Dahal for not letting him run the government, promoting factionalism and nepotism as well as not letting victims of the Nepalese Civil War get justice.\nOn 20 December 2020, K.P. Sharma Oli called on President Bidhya Devi Bhandari to dissolve the House of Representatives and call for fresh elections. In an address to the nation, Oli said he dissolved the house after the party had not let him work as prime minister and that a no-confidence motion was being prepared against him from within the party. The decision was met with criticism from within the party and seven ministers close to the Dahal–Nepal faction in his cabinet resigned in protest. On 23 February 2021, a constitutional bench led by Chief Justice Cholendra Shumsher JB Rana declared the dissolution unconstitutional, and reinstated the House to meet within 13 days. Oli respected the verdict and convened parliament on 7 March.\nOn 7 March 2021, the Supreme Court ruled to award the Nepal Communist Party to Rishiram Kattel after he challenged the Election Commission's ruling of providing the name of his party to the NCP formed after the 2018 merger. The verdict dissolved the ruling party jointly led by Oli and Dahal, reviving the former CPN (UML) and CPN (Maoist Centre) parties. This reduced Oli's government back to a coalition, exacerbating political tensions. The CPN (Maoist Centre) recalled its ministers on 13 March 2021 and withdrew its support from the Oli government on 5 May 2021, turning it into a minority government.\nOn 10 May 2021, Oli failed a vote of confidence with 93 of 232 in the House of Representatives, 43 below the 136 majority. He then became a minority Prime Minister on 13 May 2021, when no opposition party formed a majority or claimed it in time. A cabinet meeting chaired by Oli recommended the president to dissolve the House of Representatives on 22 May 2021 after members of his party led by former prime ministers Madhav Kumar Nepal and Jhala Nath Khanal supported Nepali Congress leader Sher Bahadur Deuba as the next prime minister. On 12 July 2021, the constitutional bench of the Supreme Court formed to hear the opposition's writs against the dissolution. It declared the dissolution unconstitutional and ordered the appointment of Deuba as prime minister within 28 hours. After Nepal and Khanal were suspended by the party for disobeying party orders the party split in August the former party leaders forming the Communist Party of Nepal (Unified Socialist). Oli was re-elected party chair in the 10th general convention of the CPN (UML) in November 2021 defeating Bhim Rawal in the leadership election."
        },
        {
          "heading": "Fourth term (July 2024–September 2025)",
          "content": "In the 2022 general election, his party became the second-largest party in the House of Representatives. Oli was reelected from Jhapa 5 with a majority of over 29,000 votes. After power-sharing talks broke down inside the ruling alliance, Oli and Dahal brokered a deal, backing Dahal's bid as prime minister. The UML withdrew from the coalition government ahead of the presidential election in March 2023, but joined hands with Dahal again in March 2024.\nFollowing disagreements with the prime minister and other coalition partners about the annual budget and citing the need for a stable government of national consensus, Oli and Nepali Congress' Deuba agreed on 1 July 2024 to form a rotational government with the two party chairs serving equal time as prime minister. CPN (UML) withdrew its support from the Dahal government, and following a failed a motion of confidence for Dahal in the House on 12 July, Oli was appointed prime minister for a fourth stint on 14 July as part of a coalition with the Nepali Congress, and sworn in the following day."
        },
        {
          "heading": "Resignation",
          "content": "After widespread protests that started after a government-imposed social media ban and as part of the wider movement against corruption, Oli resigned as prime minister on 9 September 2025. He along with other ministers sought shelter at an army barrack in Shivapuri."
        },
        {
          "heading": "Political positions",
          "content": "Oli credits his distant uncle Ramnath Dahal for his communist beliefs. As a student in Jhapa at the time, he was influenced by the Naxalite insurgency in West Bengal, India. He had not studied Marxism but had followed the line of Cultural Revolution in his earlier days. He later claimed that it was a \"mistaken path\".\nOli was regularly in conflict with \"hardliners\" that advocated for armed struggle against the Panchayat administration. He has been critical of the Maoists for the loss of life during the Civil War."
        },
        {
          "heading": "Relations with India",
          "content": "While organizing the Jhapa rebellion, organizers hired two Naxalite guerrillas to train their members. Oli supported Mohan Chandra Adhikari's opinion that their presence was part of India's imperialist ambitions in the region.\nOli played an important role in getting parliamentary support for the Mahakali treaty that was to be signed with India. The treaty was a reason cited for causing a split in the party and it led to Oli being seen as a pro-India leader.\nDuring his first tenure in 2015, he pushed for closer ties with China following the blockade by India. In his second tenure his government brought in amendments to the constitution which added the disputed territories of Kalapani, Lipulekh and Limpiyadhura to the official map of the country in response to the inauguration of a road across Lipulekh by India.\nDuring the COVID-19 pandemic in Nepal, Oli had lashed out at India, saying that the \"Indian virus\" was more dangerous than the \"Chinese or Italian virus\" and made light of the Indian national emblem. He said this during an address to the parliament where he blamed the rising number of coronavirus cases on individuals violating the nationwide lockdown, especially those sneaking into Nepal from India, claiming that \"people coming from India through illegal channels are spreading the virus in the country.\", which sparked a round of media attention in India.\nWhile addressing a function celebrating the 207th birth anniversary of poet Bhanubhakta Acharya on July 2020, Oli said Lord Rama was born in Nepal and India had created a fake Ayodhya. He claimed Thori, a place near Birgunj in southern Nepal, to be the birthplace of Rama and it was impossible for Rama to reach Janakpur in eastern Nepal to marry Sita from Ayodhya in India. He later launched an investigation into this matter, asking officials in the region to research the whereabouts of Ayodhyapuri. He also claimed to have found strong evidences of the real Ayodhya, supposedly including the ruins of Someshwar Gadhi and Valmiki Ashram, both of whom are associated with Lord Rama.\nOn the occasion of International Day of Yoga on 21 June 2021, Oli claimed that yoga originated in Uttarakhand and Nepal in particular. According to him, India as a country did not exist at the time when yogic science was founded. This caused backlash from Nepali and Indian social media."
        },
        {
          "heading": "Federalism and Republicanism",
          "content": "After the dissolution of the parliament in 2003, there were claims from some that Oli had dealings with the palace . He had commented that turning Nepal into a republic would be like \"making for America in a bullock cart\". Oli also defied party whip and was not present when the interim legislature declared Nepal as a republic.\nOli has been seen as favoring centralization. During his second term as prime minister he centralized more executive power into his post. He has also been seen as unwilling to let provincial and local governments function autonomously."
        },
        {
          "heading": "Electoral history",
          "content": ""
        },
        {
          "heading": "Personal life",
          "content": "Oli is married to Radhika Shakya. He met Shakya in 1987 at an event organized by CPN (Marxist–Leninist) for recently released political prisoners in Pulchowk Campus. She was working as a temporary worker for Nepal Rastra Bank at the time, while studying at Patan Campus. Later that year, the two married in a ceremony attended by 20 people.\nHe currently resides in Balkot, Bhaktapur but also has a residence in Damak, Jhapa."
        },
        {
          "heading": "Health issues",
          "content": "During his imprisonment, Oli contracted tuberculosis and he was also suffering from gastric ulcer. At the time of release, he was described to be extremely scrawny. After the 1990 revolution he developed problems in his kidneys. He underwent a kidney transplant in Apollo Hospital, New Delhi in 2007 and had a second transplant in Tribhuvan University Teaching Hospital, Kathmandu in 2020. He was admitted to intensive care where he underwent dialysis for renal disease in November 2019."
        },
        {
          "heading": "Bibliography",
          "content": "Selected speeches of K P Sharma Oli. Kathmandu: Central Office, Communist Party of Nepal – UML. 2016."
        },
        {
          "heading": "Notes",
          "content": ""
        },
        {
          "heading": "References",
          "content": ""
        },
        {
          "heading": "External links",
          "content": "K. P. Sharma Oli at the CPN UML official website"
        }
      ],
      "language": "en",
      "content_length": 19669,
      "link_count": 50,
      "image_count": 10
    },
    "ne": {
      "content": "खड्गप्रसाद शर्मा ओली (राजनैतिक नाम केपी ओली) (जन्म: विसं २००८ साल फागुन ११, नेपालका राजनीतिज्ञ तथा नेकपा (एमाले)का वर्तमान अध्यक्ष हुन्। उनी विभिन्न समयमा नेपालको गृह मन्त्री, उपप्रधानमन्त्री एवम् परराष्ट्र मन्त्रीसमेत भएका थिएँ। ओली विक्रम संवत्् २०४८ सालमा झापा क्षेत्र नम्बर ६ र २०५९ सालमा झापा क्षेत्र नम्बर २ बाट प्रतिनिधि सभा सदस्यमा निर्वाचित भएका थिएँ। त्यस्तै ओलीले विक्रम संवत्् २०५१ देखि २०५२ सम्म गृह मन्त्री थिएँ। विक्रम संवत्् २०६४ देखि २०६५ सम्म ओली उपप्रधान एवम् परराष्ट्रमन्त्री भएका थिएँ। उनी नेकपा एमालेको प्रतिनिधित्व गर्दै वि.सं २०७२ असोज २४ गते नेपालको ३८औँ प्रधानमन्त्रीको रूपमा निर्वाचित भएका थिएँ।  \nपदमा रहँदा ओली बारम्बार छुद्रो बोली , रुखो र टर्रो बोली लगाउने टिप्पणी, आलोचक र मिडियाप्रति शत्रुता, सहकर्मी र व्यापारिक सहयोगीहरूको भ्रष्टाचारमा मौनता, आर्थिक वृद्धिमा असफल हुनु र बजेट खर्चको वाचा नगरेको भन्दै विवादमा तानिएका थिएँ।\n\n\n== पारिवारिक जीवनी ==\nखड्गप्रसाद ओलीको जन्म बाबु मोहनप्रसाद ओली र मधु ओलीको पुत्रको रूपमा वि सं २००८ साल फागुन ११ गते शनिबार तेह्रथुम जिल्लाको इवा गाउँमा भएको थियो। झापामा विद्यालय जीवन सुरु गरेर ओलीले कक्षा ४ सम्मको अध्ययन गाउँमा पूरा गरेका थिएँ। ओली झापाको आदर्श माध्यमिक विद्यालयबाट विक्रम संवत्् २०२८ साल प्रवेशिका परीक्षा (एसएलसी) उत्तिर्ण भएका थिएँ। ओली वर्तमान अनन्तलिङ्गेश्वर नगरपालिका–२, बालकोट, भक्तपुरका स्थायी वासिन्दा हुन्।\n\n\n== प्रारम्भिक राजनीतिक जीवन ==\nविक्रम संवत्् २०२२ सालमा कम्युनिस्ट राजनीतिमा लागेका ओलीले २०२६ सालमा नेपाल कम्युनिस्ट पार्टीको सदस्यता लिएका थिएँ। वि.सं २०२८ सालको झापा आन्दोलनका प्रमुखहरू मध्येका एक थिएँ, त्यही वर्ष उनी जेल परेका थिएँ। ओली तत्कालिन नेकपा (माले)को संस्थापक मध्येका एक थिएँ। पञ्चायती व्यवस्थाविरुद्धको सङ्घर्षका क्रममा ओली २०२८ देखि २०४४ सम्म १४ वर्ष जेल जीवन यापन गरेका थिएँ। २०४४ मा जेलमुक्त भएपछि उनी नेपाल कम्युनिस्ट पार्टी (एकीकृत मार्क्सवादी-लेनिनवादी)को केन्द्रीय समिति सदस्य र २०५४ सम्म लुम्बिनी अञ्चलको इन्चार्ज बनेका थिएँ।\n\n\n=== बहुदलीय प्रजातन्त्र (वि.सं २०४६-२०६२) ===\nनेपालको जनआन्दोलन २०४६ पछि उनी सन् आम निर्वाचन २०४८ मा झापा–६ बाट प्रतिनिधिसभामा निर्वाचित भएका थिएँ। उनी सन् २०४८ मा नेकपा (एमाले)को विदेश सम्बन्ध विभागको प्रमुख नियुक्त भएका थिएँ।\nउनी २०५१ मा पुन: सांसदमा निर्वाचित भएका थिएँ र मनमोहन अधिकारीको अल्पमतको सरकारमा गृह मन्त्रीको रूपमा कार्यरत थिएँ। उनी २०५६ मा झापा निर्वाचन क्षेत्र २ र ६ बाट पुन: निर्वाचित भएका थिएँ जसमा उनले झापा–६ को सिट त्यागेका थिएँ।\n\n\n=== सङ्क्रमकालीन अवधि ===\nओली २०६२ सालमा गिरिजाप्रसाद कोइराला सरकारको अन्तरिम सरकारमा उपप्रधानमन्त्री तथा परराष्ट्रमन्त्री नियुक्त भएका थिएँ।\nउनी झापा-७ बाट २०६४ सालको संविधानसभा निर्वाचनमा पराजित भएका थिएँ। उनले २०६५ मा भएको नेकपा (एमाले)को आठौँ महाधिवेशन हुँदा झलनाथ खनालसँग अध्यक्षको पदका लागि पनि चुनाव हारेका थिएँ।\nउनी झापा-७ बाट २०७० सालको संविधानसभा निर्वाचनमा निर्वाचित भएका थिएँ। २०७० माघ २१\nमा उनी नेकपा (एमाले) संसदीय दलको नेता बनेका थिएँ। उनले संसदीय दलको नेताक‍ रूपमा पार्टी अध्यक्ष खनाललाई २३ मतान्तरले पराजित गरेका थिएँ। पार्टीको नवौँ महाधिवेशनको क्रममा ओली २०७१ सालमा नेकपा (एमाले)को अध्यक्षको रूपमा निर्वाचित भएका थिएँ।\n\n\n== प्रधानमन्त्रीकाल ==\n\n\n=== पहिलो प्रधानमन्त्रीकाल ===\nओली २०७२ असोज २४ मा संसदीय मतदानमा प्रधानमन्त्री निर्वाचित भएका थिएँ। व्यवस्थापिका संसदमा ५९७ सदस्यमध्ये ओलीले ३३८ मत प्राप्त गरेका थिएँ। ओलीको उम्मेदवारीलाई एकीकृत नेकपा (माओवादी), राष्ट्रिय प्रजातन्त्र पार्टी नेपाल र मधेसी जनअधिकार फोरमले अन्य १३ वटा साना दलसँग मिलेर समर्थन गरेका थिएँ। उनले असोज २५ गते शपथ ग्रहण गरेका थिएँ।\nनेपालको संविधान २०७२ जारी गर्ने प्रवन्धमा भारतले लगाएको आर्थिक नाकाबन्दीले उनको पहिलो मुद्धा नै हावी भएको थियो। उनले भारतीय निर्भरताको प्रतिरोध गर्न चीनसँग संविधान संशोधन गर्ने भारतको अडान र चीनसँग व्यापार तथा पारवहन सन्धिहरूमा हस्ताक्षर गर्ने अडान लिएका थिएँ।\nनेकपा (माओवादी केन्द्र) बाट २०७३ असार २९ मा विद्यमान गठबन्धन सरकारबाट समर्थन फिर्ता लिएपछि र २०७३ असार ३० मा पार्टीले अविश्वास प्रस्ताव दर्ता गरेपछि नेकपा (एमाले)–नेतृत्वको सरकार र प्रधानमन्त्री ओली अल्पमतमा खुम्चिएका थिएँ जसका कारण उनलाई राजीनामा दिन दबाब पैदा भएको थियो। तथापि, नेकपा (एमाले)ले गृहमा दर्ता गरिएको अविश्वास प्रस्तावबारे छलफल गर्ने निर्णय गरेको थियो जसले गर्दा सम्बन्धित पक्षहरूको तीन दिने संसदीय बैठक बसेको थियो। प्रक्रियाको क्रममा अन्य दुई प्रमुख दल राष्ट्रिय प्रजातन्त्र पार्टी र मधेसी जनअधिकार फोरमले पनि गठबन्धनबाट समर्थन फिर्ता लिएको थियो। तेस्रो दिन २०७३ साउन ९ मा संसदमा विपक्षी दलहरूलाई सम्बोधन गरेपछि ओलीले राजीनामाको घोषणा गरेका गरेका थिएँ। भारतले लगाएको आर्थिक नाकाबन्दी विरुद्ध दृढ अडान राख्दै ओलीलाई तल झार्ने षड्यन्त्र गरेको आरोप भारत सरकारमाथि लागेको थियो। भारतको बाह्य मामिला मन्त्रालयले स्पष्ट रूपमा उक्त आरोपलाई अस्वीकार गरेको थियो।\n\n\n=== दोस्रो प्रधानमन्त्रीकाल ===\n\nनेपाल कम्युनिस्ट पार्टी (माओवादी केन्द्र)को समर्थनमा २०७४ सालको प्रतिनिधि सभा निर्वाचनपछि नेकपा (एमाले) प्रतिनिधि सभामा सबैभन्दा ठुलो दल बनेपछि ओली २०७४ फागुन ३ मा दोस्रो पटक प्रधानमन्त्री नियुक्त भएका थिएँ। उनले २०७४ फागुन २७ मा २७५ सदस्यीय प्रतिनिधि सभामा २६८ मतमध्ये २०८ मतसहित विश्वासको प्रस्ताव पारित गरेका थिएँ।  नेकपा (एमाले) र नेकपा (माओवादी केन्द्र)को वाम गठबन्धन ले २०७५ जेठ ३ मा नेपाल कम्युनिस्ट पार्टी (नेकपा) गठन गरी ओलीको गठबन्धन सरकारलाई बहुमतमा परिणत गर्दै सदनमा दुई तिहाई बहुमत दिलाएको थियो।\nजेठ २०७७ मा, ओली सरकारले भारत सरकारद्वारा लिपुलेक पारिको सडकको उद्घाटनको जवाफमा कालापानी, लिपुलेक र लिम्पियाधुराका विवादित इलाकाहरू सहित देशका नयाँ नक्साहरू अनावरण गरेको थियो, जसले गर्दा दुई देशबीच \"मनमुटाव\" भएको थियो। सरकारले संसदमा मुलुकको आधिकारिक नक्सा र चिह्नलाई संशोधन गर्न संविधान संशोधन विधेयक तत्काल ल्याएको थियो। राष्ट्रपति विद्यादेवी भण्डारीले प्रमाणीकरण गर्नुअघि दुवै सदनमा सर्वसम्मतिले विधेयक पारित भएको थियो।\n५ पुस २०७७ मा ओली सरकारले प्रतिनिधिसभा विघटनको सिफारिस गरेको थियो र २०७८ वैशाख १७ र वैशाख २७ मा, निर्वाचनको आह्वान गरेको थियो।  यसलाई राष्ट्रपतिले सजिलै समर्थन गरेको एउटा कदमको रूपमा लिने गरिन्छ। ओलीले सत्तारुढ नेकपामा एकपछि अर्को सङ्घर्ष गरेपछि यो कदम चालेको बताइएको थियो। यो कदम पार्टीको गुटसँग टुङ्गिएको थियो। त्यसको नेतृत्व पूर्व प्रधानमन्त्री पुष्पकमल दाहाल र माधवकुमार नेपालले गरेका थिएँ।  उनले सदनमा ओली विरुद्ध अविश्वासको प्रस्ताव दर्ता गर्ने योजना लिएका थिएँ। विवादास्पद संवैधानिक परिषद् ऐन फिर्ता लिन ओलीको अधैर्यताले सत्तारुढ दलमा थप तनाव उत्पन्न भएको थियो। ओलीको यो निर्णय २०७७ फागुन ११ मा सर्वोच्च न्यायालयले बदर गरेको थियो। प्रधानन्यायाधीश चोलेन्द्रशम्शेर राणा नेतृत्वको संवैधानिक इजलासले संसद विघटनलाई असंवैधानिक ठहर गर्दै सदनलाई पुनर्बहाली गर्न र संसदको बैठक १३ दिनभित्र गर्न आह्वान गरेको थियो।\nओलीले सर्वोच्च न्यायालयको फैसला स्वीकार गर्दै २०७७ फागुन २३ मा, संसद्को बैठक आह्वान गरेका थिएँ।\n२३ फागुन २०७७ मा सर्वोच्च न्यायालयले नेपाल कम्युनिस्ट पार्टीलाई ऋषिराम कट्टेललाई प्रदान गर्ने ऐतिहासिक फैसला सुनाएको थियो।  उनले नेकपा (एमाले) र नेकपा (माओवादी केन्द्र) विलय भएपछि गठन भएको नेकपालाई आफ्नो दलको नाम उपलब्ध गराउने निर्वाचन आयोगको फैसलालाई चुनौती दिएको थिएँ। न्यायालयको फैसलाले ओली र दाहालको नेतृत्वमा संयुक्त रूपमा सत्तारुढ दललाई अमान्य बनाएको थियो। यो फैसलाले पूर्व नेकपा (एमाले) र नेकपा (माओवादी केन्द्र) दलहरूलाई प्रभावकारी ढङ्गले पुनर्बहाली गरेको थियो। यसले ओली सरकारलाई फेरि गठबन्धनमा परिणत गरेको थियो। नेकपा (माओवादी केन्द्र) ले २०७७ फागुन २९ मा आफ्ना मन्त्रीहरूलाई सम्झाएर २०७८ वैशाख २२ मा ओली सरकारबाट दिएको समर्थन फिर्ता लिएको थियो। त्यसलाई प्रभावकारी ढङ्गले अल्पमतको सरकारमा परिणत गरेको थियो।\n२०७८ वैशाख २७ मा, प्रतिनिधि सभामा खसेको कुल २३२ मतमध्ये ९३ मत मात्र प्राप्त गर्दै ओलीले विश्वासको मत प्राप्त गर्न असमर्थ रहेका थिएँ। विश्वासको मत प्राप्त गर्न आवश्यक १३६ मतको बहुमत पुग्न नसक्दा ओली ४३ मतले कम भएको थियो।  राष्ट्रपतिद्वारा अर्को प्रधानमन्त्री नियुक्त नभएसम्म उनको हैसियत पछि सरोकारवाला प्रधानमन्त्रीको दर्जामा परिणत भएको थियो।\n\n\n=== तेस्रो प्रधानमन्त्रीकाल ===\n\nओलीलाई राष्ट्रपति विद्यादेवी भण्डारीले २०७८ वैशाख ३० मा तेस्रो पटक प्रधानमन्त्री नियुक्त गरेकी थिइन्। अल्पमतको प्रधानमन्त्री भए पनि विपक्षी दलमध्ये कुनै पनि दलले बहुमतको सरकार गठन गर्न वा त्यसका लागि आफ्नो दावी उपलब्ध समय सीमाभित्र राख्न असमर्थ रहेका थिएँ। २०७८ जेठ ८ मा मध्यरातमा राष्ट्रपतिद्वारा प्रतिनिधि सभा विघटनपछि ओली सरकार नयाँ निर्वाचन सम्पन्न नभएसम्म अन्तरिम सरकारमा परिणत भएको थियो। मध्यावधि निर्वाचन कात्तिक २६ र २०७८ मङ्सिर ३ का लागि तय गरिएको थियो।\n२०७८ असार २८ मा विपक्षी गठवन्धनले दायर गरेको प्रतिनिधिसभा विघटन विरुद्धको रिटको सुनुवाइ गर्न गठित सर्वोच्च न्यायालयको संवैधानिक इजलासले राष्ट्रपति विद्यादेवी भण्डारीले प्रधानमन्त्री ओलीको सिफारिसमा प्रतिनिधिसभा भङ्ग गर्ने निर्णय गैरकानुनी भएको उल्लेख गर्दै नेपाली काङ्ग्रेसका सभापति शेरबहादुर देउवालाई २८ घण्टाभित्र प्रधानमन्त्री नियुक्त गर्न आदेश दिएको थियो।\nप्रधानमन्त्रीबाट हटेपछि, २०७८ मङ्सिर १० मा, चितवनमा भएको नेकपा एमालेको दशौँ राष्ट्रिय महाधिवेशनमा उनी अध्यक्षमा पुन:निर्वाचित भएका थिएँ। जेन–जीको आन्दोलन नियन्त्रण बाहिर पुगेपछि राजनीतिक निकासका लागि प्रधानमन्त्री केपी शर्मा ओलीले २०८२ भदौ २४ गते  राजीनामा दिएका हुन्। \n\n\n== निर्वाचनको इतिहास ==\nउनी नेकपा (एमाले)को तर्फबाट टिकट प्राप्त गर्दै प्रतिनिधि सभामा २०४८, २०५१, २०५६, र २०७४मा निर्वाचित भएका थिएँ। उनले आम निर्वाचन २०५६मा दुईवटा निर्वाचन क्षेत्रबाट चुनाव जितेका थिएँ। संविधानसभा निर्वाचन, २०६४मा उनले पराजय बेहोरेका थिएँ। यस तालिकामा शीर्ष प्रतिस्पर्धीहरू मात्र समेटिएको छ।\n\n\n=== आम निर्वाचन २०४८ ===\n\n\n=== आम निर्वाचन २०५१ ===\n\n\n=== आम निर्वाचन २०५६ ===\n\n\n=== संविधानसभा निर्वाचन, २०६४ ===\n\n\n=== संविधानसभा निर्वाचन २०७० ===\n\n\n=== २०७२ को संसदीय प्रधानमन्त्री पदको निर्वाचन ===\n\n\n=== प्रतिनिधिसभा निर्वाचन, २०७४ ===\n\n\n== व्यक्तिगत जीवन ==\nजेलबाट छुटेपछि ओलीको राधिका शाक्यसँग विवाह गरेका थिएँ। उनीहरूको पहिलो भेट पार्टीका एक कार्यक्रममा भएको थियो।\n\n\n=== स्वास्थ समस्य ===\nओलीले दुई पटक मिर्गौला प्रत्यारोपण गरेका छन्। पहिलो पटक २०६३ मा नयाँ दिल्लीको अपोलो अस्पतालमा प्रत्यारोपण गरिएको थियो।  २०७६ सालमा त्रिभुवन विश्वविद्यालय शिक्षण अस्पताल, काठमाडौँमा दोस्रो पटक उनको मृगौला प्रत्यारोपण गरिएको थियो। दोस्रो प्रत्यारोपणका लागि उनले ३२ वर्षीया समिक्षा सङ्ग्रौलाबाट मिर्गौला पाएका थिएँ। समिक्षा सङ्गौला ओलीको भान्जी रहेको जनाइएको थियो। २०६३ मा मृगौला प्रत्यारोपण गरेका नयाँ दिल्लीका एक वरिष्ठ प्रत्यारोपण चिकित्सक पनि काठमाडौँमा यस प्रक्रियालाई सहयोग गर्न उपस्थित भएका थिएँ।\n\n\n== विवादास्पद दावीहरू ==\nकेपी शर्मा ओलीले विभिन्न कार्यक्रमहरूमा विवादास्पद दावी तथा टीकाटिप्पणी गरेका छन्। उनले आफ्ना भनाइहरूमा विभिन्न किसिमका उखान टुक्काको पनि प्रयोग गर्ने गरेका छन्। यस्ता केही दावीहरूले दोहोर अर्थ दिनुका साथै आलोचना पनि भएको थियो। उनका केही विवादास्पद दाबीहरू यस प्रकार छन्:\n१) सुपर कम्प्युटर, माघ २०७५: ओलीले नेपालले निर्माण गरिरहेको सुपरकम्प्युटर देखेर संसार नै चकित भएको दावी गरेका थिएँ। उनले बनेपा आइटी पार्कमा निर्माण भइरहेको कम्प्युटरलाई सङ्केत गर्दै आएका थिएँ। कम्पुटिङ पावरको कमी भए पनि निर्माताहरूले सुपर कम्प्युटर भएको दावी गरेका छन्।\n२) गैँडा र सगरमाथा, भदौ २०७६: ओलीले गैँडाको लागि प्रयोग गरिने अङ्ग्रेजी शब्द राइनो र सगरमाथालाई जनाउने माउन्ट एभरेस्टलाई नेपाली शब्द गैँडा र सगरमाथा प्रयोग गर्नुपर्ने बताएका थिएँ।\n३) भारतीय कोरोनाभाइरस, २०७७ बैशाख : नेपालमा कोभिड–१९ महामारीका बेला ओलीले 'चिनियाँ वा इटालेेेली भाइरस' भन्दा पनि 'भारतीय भाइरस' बढी खतरनाक भएको भन्दै आक्रोश पोखेका थिएँ। उनले यो कुरा संसदलाई सम्बोधन गर्दै गर्दा भनेका थिएँ जहाँ उनले राष्ट्रव्यापी बन्दाबन्दी उल्लङ्घन गर्ने व्यक्तिहरूमा कोरोनाभाइरसको बढ्दो सङ्ख्यालाई दोषी ठहर्‍याएका थिएँ। उनले विशेष गरी भारतबाट नेपालमा सुटुक्क छिर्नेहरूलाई निसाना बनाएका थिएँ। भारतबाट अवैध माध्यमबाट आउने मानिसहरूले देशमा भाइरस फैलाउँदैछन् भनेर दावी गरेका थिएँ जसले गर्दा भारतका सञ्चार माध्यमहरूको ध्यानाकर्षण गरेको थियो।\n३) हाच्छ्युँ सम्बन्धित भनाइ, २०७७ असार : राष्ट्रियसभालाई सम्बोधन गर्दै ओलीले कोरोना ज्वरोजस्तै हो, यदि यो रोग लाग्यो भने, कसैले हाच्छ्युँ गर्ने र तातोपानी र बेसार सेवन गरेर भाइरसलाई धपाउनुपर्ने दावी गरेका थिएँ जसले\nराष्ट्रिय सञ्चार माध्यम र सामाजिक सञ्जालमा बहस उत्पन्न गरेको थियो। उनले लसुन र बेसारले कोरोनाभाइरस विरुद्ध लड्न रोग प्रतिरोधात्मक प्रणालीलाई बढाउन मदत गर्ने बताएका थिएँ।\n४) भगवान राम एक नेपाली हुन् भन्ने भनाइ:  असार २०७७: कवि भानुभक्त आचार्यको २०७औँ जन्म जयन्ती मनाउने कार्यलाई सम्बोधन गर्दै ओलीले भगवान रामको जन्म नेपालमा भएको दावी गरेका थिएँ  भने उनले भारतले नक्कली अयोध्या सिर्जना गरेको बताएका थिएँ। उनले दक्षिण नेपालको ठोरीलाई रामको जन्मस्थल भएको दावी गरेका थिएँ भने भारतको अयोध्याबाट सीतासँग विवाह गर्न पूर्वी नेपालको जनकपुर पुग्नु रामका लागि असम्भव रहेको बताएका थिएँ। पछि उनले यस विषयमा छानबिन गर्न आदेश दिएका थिएँ। उनले त्यस क्षेत्रका अधिकारीहरूलाई अयोध्यापुरी कहाँ छ भन्ने विषयमा अध्ययन गर्न आग्रह गरेका थिएँ। उनले वास्तविक अयोध्याको बलियो प्रमाण पनि भेट्टाएको दावी गरेका थिएँ। यसमा सोमेश्वर गढी र वाल्मीकि आश्रमका भग्नावशेषहरू पनि समावेश भएको र यी दुवै भगवान रामसँग सम्बन्धित रहेको उनले बताएका थिएँ।\n५) योगको उत्पत्ति नेपाल: असार २०७७ मा, ओलीले योगको उत्पत्ति नेपालबाट भएको दावी गरेका थिएँ। २०७८ असार ७ मा अन्तर्राष्ट्रिय योग दिवसको अवसरमा ओलीले योगको उत्पत्ति उत्तराखण्ड र विशेष गरी नेपालमा भएको दावी गरेका थिएँ। उनका अनुसार योग विज्ञानको स्थापना भएको समयमा भारत एक देशको रूपमा अस्तित्वमा थिएँन। यसले गर्दा नेपाली र भारतीय सामाजिक सञ्जालहरूबाट एकपछि अर्को प्रतिक्रिया प्राप्त भएको थियो।\n\n\n== सन्दर्भ सामग्रीहरू ==\n\n\n== बाह्य कडीहरू ==\nनेकपा एमालेको आधिकारिक वेबसाइट   वेब्याक मेसिन अभिलेखिकरण २००६-०१-१० मिति",
      "url": "https://ne.wikipedia.org/wiki/%E0%A4%96%E0%A4%A1%E0%A5%8D%E0%A4%97%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A4%B8%E0%A4%BE%E0%A4%A6_%E0%A4%93%E0%A4%B2%E0%A5%80",
      "title": "खड्गप्रसाद ओली",
      "summary": "खड्गप्रसाद शर्मा ओली (राजनैतिक नाम केपी ओली) (जन्म: विसं २००८ साल फागुन ११, नेपालका राजनीतिज्ञ तथा नेकपा (एमाले)का वर्तमान अध्यक्ष हुन्। उनी विभिन्न समयमा नेपालको गृह मन्त्री, उपप्रधानमन्त्री एवम् परराष्ट्र मन्त्रीसमेत भएका थिएँ। ओली विक्रम संवत्् २०४८ सालमा झापा क्षेत्र नम्बर ६ र २०५९ सालमा झापा क्षेत्र नम्बर २ बाट प्रतिनिधि सभा सदस्यमा निर्वाचित भएका थिएँ। त्यस्तै ओलीले विक्रम संवत्् २०५१ देखि २०५२ सम्म गृह मन्त्री थिएँ। विक्रम संवत्् २०६४ देखि २०६५ सम्म ओली उपप्रधान एवम् परराष्ट्रमन्त्री भएका थिएँ। उनी नेकपा एमालेको प्रतिनिधित्व गर्दै वि.सं २०७२ असोज २४ गते नेपालको ३८औँ प्रधानमन्त्रीको रूपमा निर्वाचित भएका थिएँ।  \nपदमा रहँदा ओली बारम्बार छुद्रो बोली , रुखो र टर्रो बोली लगाउने टिप्पणी, आलोचक र मिडियाप्रति शत्रुता, सहकर्मी र व्यापारिक सहयोगीहरूको भ्रष्टाचारमा मौनता, आर्थिक वृद्धिमा असफल हुनु र बजेट खर्चको वाचा नगरेको भन्दै विवादमा तानिएका थिएँ।\n\n",
      "categories": [
        "श्रेणी:All articles with dead external links",
        "श्रेणी:Pages with reference errors",
        "श्रेणी:अङ्ग्रेजी भाषाका बाह्य कडीहरू",
        "श्रेणी:खस जाति",
        "श्रेणी:छोटो विवरण विकिडाटाबाट भिन्न छ",
        "श्रेणी:ढाँचाको यस खण्डमा पृष्ठहरू दोहोरो तर्कहरू प्रयोग गरिरहेका छन्",
        "श्रेणी:तेह्रथुम जिल्लाका मानिसहरू",
        "श्रेणी:नेपाल कम्युनिस्ट पार्टी (२०७५–२०७७)का राजनीतिज्ञहरू",
        "श्रेणी:नेपाल सरकारका पूर्व मन्त्रीहरू",
        "श्रेणी:नेपाल सरकारका मन्त्रीहरू",
        "श्रेणी:नेपालका अर्थ मन्त्रीहरू",
        "श्रेणी:नेपालका उप-प्रधानमन्त्रीहरू",
        "श्रेणी:नेपालका परराष्ट्र मन्त्रीहरू",
        "श्रेणी:नेपालका प्रधानमन्त्रीहरू",
        "श्रेणी:नेपालका सांसदहरू २०७९–२०८२",
        "श्रेणी:नेपाली राजनीतिज्ञहरू",
        "श्रेणी:प्रमुख लेखहरू",
        "श्रेणी:विकिथन-४ मा बनाइएका वा सुधारिएका लेखहरू",
        "श्रेणी:वेब अभिलेख ढाँचा",
        "श्रेणी:वेब अभिलेख ढाँचा वेब्याक सूत्र",
        "श्रेणी:सङ्क्षिप्त विवरण भएका लेखहरू",
        "श्रेणी:सन् १९५२ मा जन्म"
      ],
      "links": [
        "Archive.today",
        "आम निर्वाचन २०४८",
        "आम निर्वाचन २०५१",
        "आम निर्वाचन २०५६",
        "काठमाडौँ",
        "कालापानी",
        "कीर्तीनिधि विष्ट",
        "कुँवर इन्द्रजीत सिंह",
        "कृष्णप्रसाद भट्टराई",
        "कृष्णबहादुर राणा",
        "कोशी प्रदेश",
        "खिलराज रेग्मी",
        "गिरिजाप्रसाद कोइराला",
        "गृह मन्त्री (नेपाल)",
        "गेहेन्द्र बहादुर राजभण्डारी",
        "चन्द्र शमशेर जङ्गबहादुर राणा",
        "चन्द्रप्रकाश मैनाली",
        "चितवन जिल्ला",
        "चोलेन्द्रशमशेर ज.ब.रा.",
        "जङ्गबहादुर राणा",
        "जुद्ध शमशेर जङ्गबहादुर राणा",
        "ज्ञानेन्द्र वीरविक्रम शाह",
        "झलनाथ खनाल",
        "झापा ५ (निर्वाचन क्षेत्र)",
        "टङ्कप्रसाद आचार्य",
        "तुलसी गिरी",
        "तेस्रो ओली मन्त्रिपरिषद्",
        "तेह्रथुम जिल्ला",
        "दामोदर पाँडे",
        "देव शमशेर जङ्गबहादुर राणा",
        "दोस्रो ओली मन्त्रिपरिषद्",
        "नगेन्द्रप्रसाद रिजाल",
        "नेकपा (एमाले)को १०औँ महाधिवेशन",
        "नेपाल",
        "नेपाल अधिराज्य",
        "नेपाल कम्युनिस्ट पार्टी (एकीकृत मार्क्सवादी-लेनिनवादी)",
        "नेपाल कम्युनिस्ट पार्टी (माओवादी केन्द्र)",
        "नेपाल कम्युनिस्ट पार्टी (मार्क्सवादी-लेनिनवादी)",
        "नेपाल कम्युनिस्ट पार्टी (२०७५–२०७७)",
        "नेपालका प्रधानमन्त्रीहरू",
        "नेपालको इतिहास",
        "नेपालको उपप्रधानमन्त्री",
        "नेपालको जनआन्दोलन २०४६",
        "नेपालको जनआन्दोलन २०६३",
        "नेपालको प्रधानमन्त्री",
        "नेपालको राष्ट्रपति",
        "नेपालको संविधान",
        "नेपालको संविधान २०७२",
        "नेपालको सर्वोच्च अदालत",
        "नेपालमा बजेट"
      ],
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/e/e7/Cscr-featured.svg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9b/Flag_of_Nepal.svg",
        "https://upload.wikimedia.org/wikipedia/commons/3/34/KP_Oli_Signature.svg",
        "https://upload.wikimedia.org/wikipedia/commons/d/dd/The_Prime_Minister_of_Nepal%2C_Shri_KP_Sharma_Oli_at_Bangkok%2C_in_Thailand_on_April_04%2C_2025_%28cropped%29.jpg"
      ],
      "sections": [
        {
          "heading": "पारिवारिक जीवनी",
          "content": "खड्गप्रसाद ओलीको जन्म बाबु मोहनप्रसाद ओली र मधु ओलीको पुत्रको रूपमा वि सं २००८ साल फागुन ११ गते शनिबार तेह्रथुम जिल्लाको इवा गाउँमा भएको थियो। झापामा विद्यालय जीवन सुरु गरेर ओलीले कक्षा ४ सम्मको अध्ययन गाउँमा पूरा गरेका थिएँ। ओली झापाको आदर्श माध्यमिक विद्यालयबाट विक्रम संवत्् २०२८ साल प्रवेशिका परीक्षा (एसएलसी) उत्तिर्ण भएका थिएँ। ओली वर्तमान अनन्तलिङ्गेश्वर नगरपालिका–२, बालकोट, भक्तपुरका स्थायी वासिन्दा हुन्।"
        },
        {
          "heading": "प्रारम्भिक राजनीतिक जीवन",
          "content": "विक्रम संवत्् २०२२ सालमा कम्युनिस्ट राजनीतिमा लागेका ओलीले २०२६ सालमा नेपाल कम्युनिस्ट पार्टीको सदस्यता लिएका थिएँ। वि.सं २०२८ सालको झापा आन्दोलनका प्रमुखहरू मध्येका एक थिएँ, त्यही वर्ष उनी जेल परेका थिएँ। ओली तत्कालिन नेकपा (माले)को संस्थापक मध्येका एक थिएँ। पञ्चायती व्यवस्थाविरुद्धको सङ्घर्षका क्रममा ओली २०२८ देखि २०४४ सम्म १४ वर्ष जेल जीवन यापन गरेका थिएँ। २०४४ मा जेलमुक्त भएपछि उनी नेपाल कम्युनिस्ट पार्टी (एकीकृत मार्क्सवादी-लेनिनवादी)को केन्द्रीय समिति सदस्य र २०५४ सम्म लुम्बिनी अञ्चलको इन्चार्ज बनेका थिएँ।"
        },
        {
          "heading": "बहुदलीय प्रजातन्त्र (वि.सं २०४६-२०६२)",
          "content": "नेपालको जनआन्दोलन २०४६ पछि उनी सन् आम निर्वाचन २०४८ मा झापा–६ बाट प्रतिनिधिसभामा निर्वाचित भएका थिएँ। उनी सन् २०४८ मा नेकपा (एमाले)को विदेश सम्बन्ध विभागको प्रमुख नियुक्त भएका थिएँ।\nउनी २०५१ मा पुन: सांसदमा निर्वाचित भएका थिएँ र मनमोहन अधिकारीको अल्पमतको सरकारमा गृह मन्त्रीको रूपमा कार्यरत थिएँ। उनी २०५६ मा झापा निर्वाचन क्षेत्र २ र ६ बाट पुन: निर्वाचित भएका थिएँ जसमा उनले झापा–६ को सिट त्यागेका थिएँ।"
        },
        {
          "heading": "सङ्क्रमकालीन अवधि",
          "content": "ओली २०६२ सालमा गिरिजाप्रसाद कोइराला सरकारको अन्तरिम सरकारमा उपप्रधानमन्त्री तथा परराष्ट्रमन्त्री नियुक्त भएका थिएँ।\nउनी झापा-७ बाट २०६४ सालको संविधानसभा निर्वाचनमा पराजित भएका थिएँ। उनले २०६५ मा भएको नेकपा (एमाले)को आठौँ महाधिवेशन हुँदा झलनाथ खनालसँग अध्यक्षको पदका लागि पनि चुनाव हारेका थिएँ।\nउनी झापा-७ बाट २०७० सालको संविधानसभा निर्वाचनमा निर्वाचित भएका थिएँ। २०७० माघ २१\nमा उनी नेकपा (एमाले) संसदीय दलको नेता बनेका थिएँ। उनले संसदीय दलको नेताक‍ रूपमा पार्टी अध्यक्ष खनाललाई २३ मतान्तरले पराजित गरेका थिएँ। पार्टीको नवौँ महाधिवेशनको क्रममा ओली २०७१ सालमा नेकपा (एमाले)को अध्यक्षको रूपमा निर्वाचित भएका थिएँ।"
        },
        {
          "heading": "प्रधानमन्त्रीकाल",
          "content": ""
        },
        {
          "heading": "पहिलो प्रधानमन्त्रीकाल",
          "content": "ओली २०७२ असोज २४ मा संसदीय मतदानमा प्रधानमन्त्री निर्वाचित भएका थिएँ। व्यवस्थापिका संसदमा ५९७ सदस्यमध्ये ओलीले ३३८ मत प्राप्त गरेका थिएँ। ओलीको उम्मेदवारीलाई एकीकृत नेकपा (माओवादी), राष्ट्रिय प्रजातन्त्र पार्टी नेपाल र मधेसी जनअधिकार फोरमले अन्य १३ वटा साना दलसँग मिलेर समर्थन गरेका थिएँ। उनले असोज २५ गते शपथ ग्रहण गरेका थिएँ।\nनेपालको संविधान २०७२ जारी गर्ने प्रवन्धमा भारतले लगाएको आर्थिक नाकाबन्दीले उनको पहिलो मुद्धा नै हावी भएको थियो। उनले भारतीय निर्भरताको प्रतिरोध गर्न चीनसँग संविधान संशोधन गर्ने भारतको अडान र चीनसँग व्यापार तथा पारवहन सन्धिहरूमा हस्ताक्षर गर्ने अडान लिएका थिएँ।\nनेकपा (माओवादी केन्द्र) बाट २०७३ असार २९ मा विद्यमान गठबन्धन सरकारबाट समर्थन फिर्ता लिएपछि र २०७३ असार ३० मा पार्टीले अविश्वास प्रस्ताव दर्ता गरेपछि नेकपा (एमाले)–नेतृत्वको सरकार र प्रधानमन्त्री ओली अल्पमतमा खुम्चिएका थिएँ जसका कारण उनलाई राजीनामा दिन दबाब पैदा भएको थियो। तथापि, नेकपा (एमाले)ले गृहमा दर्ता गरिएको अविश्वास प्रस्तावबारे छलफल गर्ने निर्णय गरेको थियो जसले गर्दा सम्बन्धित पक्षहरूको तीन दिने संसदीय बैठक बसेको थियो। प्रक्रियाको क्रममा अन्य दुई प्रमुख दल राष्ट्रिय प्रजातन्त्र पार्टी र मधेसी जनअधिकार फोरमले पनि गठबन्धनबाट समर्थन फिर्ता लिएको थियो। तेस्रो दिन २०७३ साउन ९ मा संसदमा विपक्षी दलहरूलाई सम्बोधन गरेपछि ओलीले राजीनामाको घोषणा गरेका गरेका थिएँ। भारतले लगाएको आर्थिक नाकाबन्दी विरुद्ध दृढ अडान राख्दै ओलीलाई तल झार्ने षड्यन्त्र गरेको आरोप भारत सरकारमाथि लागेको थियो। भारतको बाह्य मामिला मन्त्रालयले स्पष्ट रूपमा उक्त आरोपलाई अस्वीकार गरेको थियो।"
        },
        {
          "heading": "दोस्रो प्रधानमन्त्रीकाल",
          "content": "नेपाल कम्युनिस्ट पार्टी (माओवादी केन्द्र)को समर्थनमा २०७४ सालको प्रतिनिधि सभा निर्वाचनपछि नेकपा (एमाले) प्रतिनिधि सभामा सबैभन्दा ठुलो दल बनेपछि ओली २०७४ फागुन ३ मा दोस्रो पटक प्रधानमन्त्री नियुक्त भएका थिएँ। उनले २०७४ फागुन २७ मा २७५ सदस्यीय प्रतिनिधि सभामा २६८ मतमध्ये २०८ मतसहित विश्वासको प्रस्ताव पारित गरेका थिएँ।  नेकपा (एमाले) र नेकपा (माओवादी केन्द्र)को वाम गठबन्धन ले २०७५ जेठ ३ मा नेपाल कम्युनिस्ट पार्टी (नेकपा) गठन गरी ओलीको गठबन्धन सरकारलाई बहुमतमा परिणत गर्दै सदनमा दुई तिहाई बहुमत दिलाएको थियो।\nजेठ २०७७ मा, ओली सरकारले भारत सरकारद्वारा लिपुलेक पारिको सडकको उद्घाटनको जवाफमा कालापानी, लिपुलेक र लिम्पियाधुराका विवादित इलाकाहरू सहित देशका नयाँ नक्साहरू अनावरण गरेको थियो, जसले गर्दा दुई देशबीच \"मनमुटाव\" भएको थियो। सरकारले संसदमा मुलुकको आधिकारिक नक्सा र चिह्नलाई संशोधन गर्न संविधान संशोधन विधेयक तत्काल ल्याएको थियो। राष्ट्रपति विद्यादेवी भण्डारीले प्रमाणीकरण गर्नुअघि दुवै सदनमा सर्वसम्मतिले विधेयक पारित भएको थियो।\n५ पुस २०७७ मा ओली सरकारले प्रतिनिधिसभा विघटनको सिफारिस गरेको थियो र २०७८ वैशाख १७ र वैशाख २७ मा, निर्वाचनको आह्वान गरेको थियो।  यसलाई राष्ट्रपतिले सजिलै समर्थन गरेको एउटा कदमको रूपमा लिने गरिन्छ। ओलीले सत्तारुढ नेकपामा एकपछि अर्को सङ्घर्ष गरेपछि यो कदम चालेको बताइएको थियो। यो कदम पार्टीको गुटसँग टुङ्गिएको थियो। त्यसको नेतृत्व पूर्व प्रधानमन्त्री पुष्पकमल दाहाल र माधवकुमार नेपालले गरेका थिएँ।  उनले सदनमा ओली विरुद्ध अविश्वासको प्रस्ताव दर्ता गर्ने योजना लिएका थिएँ। विवादास्पद संवैधानिक परिषद् ऐन फिर्ता लिन ओलीको अधैर्यताले सत्तारुढ दलमा थप तनाव उत्पन्न भएको थियो। ओलीको यो निर्णय २०७७ फागुन ११ मा सर्वोच्च न्यायालयले बदर गरेको थियो। प्रधानन्यायाधीश चोलेन्द्रशम्शेर राणा नेतृत्वको संवैधानिक इजलासले संसद विघटनलाई असंवैधानिक ठहर गर्दै सदनलाई पुनर्बहाली गर्न र संसदको बैठक १३ दिनभित्र गर्न आह्वान गरेको थियो।\nओलीले सर्वोच्च न्यायालयको फैसला स्वीकार गर्दै २०७७ फागुन २३ मा, संसद्को बैठक आह्वान गरेका थिएँ।\n२३ फागुन २०७७ मा सर्वोच्च न्यायालयले नेपाल कम्युनिस्ट पार्टीलाई ऋषिराम कट्टेललाई प्रदान गर्ने ऐतिहासिक फैसला सुनाएको थियो।  उनले नेकपा (एमाले) र नेकपा (माओवादी केन्द्र) विलय भएपछि गठन भएको नेकपालाई आफ्नो दलको नाम उपलब्ध गराउने निर्वाचन आयोगको फैसलालाई चुनौती दिएको थिएँ। न्यायालयको फैसलाले ओली र दाहालको नेतृत्वमा संयुक्त रूपमा सत्तारुढ दललाई अमान्य बनाएको थियो। यो फैसलाले पूर्व नेकपा (एमाले) र नेकपा (माओवादी केन्द्र) दलहरूलाई प्रभावकारी ढङ्गले पुनर्बहाली गरेको थियो। यसले ओली सरकारलाई फेरि गठबन्धनमा परिणत गरेको थियो। नेकपा (माओवादी केन्द्र) ले २०७७ फागुन २९ मा आफ्ना मन्त्रीहरूलाई सम्झाएर २०७८ वैशाख २२ मा ओली सरकारबाट दिएको समर्थन फिर्ता लिएको थियो। त्यसलाई प्रभावकारी ढङ्गले अल्पमतको सरकारमा परिणत गरेको थियो।\n२०७८ वैशाख २७ मा, प्रतिनिधि सभामा खसेको कुल २३२ मतमध्ये ९३ मत मात्र प्राप्त गर्दै ओलीले विश्वासको मत प्राप्त गर्न असमर्थ रहेका थिएँ। विश्वासको मत प्राप्त गर्न आवश्यक १३६ मतको बहुमत पुग्न नसक्दा ओली ४३ मतले कम भएको थियो।  राष्ट्रपतिद्वारा अर्को प्रधानमन्त्री नियुक्त नभएसम्म उनको हैसियत पछि सरोकारवाला प्रधानमन्त्रीको दर्जामा परिणत भएको थियो।"
        },
        {
          "heading": "तेस्रो प्रधानमन्त्रीकाल",
          "content": "ओलीलाई राष्ट्रपति विद्यादेवी भण्डारीले २०७८ वैशाख ३० मा तेस्रो पटक प्रधानमन्त्री नियुक्त गरेकी थिइन्। अल्पमतको प्रधानमन्त्री भए पनि विपक्षी दलमध्ये कुनै पनि दलले बहुमतको सरकार गठन गर्न वा त्यसका लागि आफ्नो दावी उपलब्ध समय सीमाभित्र राख्न असमर्थ रहेका थिएँ। २०७८ जेठ ८ मा मध्यरातमा राष्ट्रपतिद्वारा प्रतिनिधि सभा विघटनपछि ओली सरकार नयाँ निर्वाचन सम्पन्न नभएसम्म अन्तरिम सरकारमा परिणत भएको थियो। मध्यावधि निर्वाचन कात्तिक २६ र २०७८ मङ्सिर ३ का लागि तय गरिएको थियो।\n२०७८ असार २८ मा विपक्षी गठवन्धनले दायर गरेको प्रतिनिधिसभा विघटन विरुद्धको रिटको सुनुवाइ गर्न गठित सर्वोच्च न्यायालयको संवैधानिक इजलासले राष्ट्रपति विद्यादेवी भण्डारीले प्रधानमन्त्री ओलीको सिफारिसमा प्रतिनिधिसभा भङ्ग गर्ने निर्णय गैरकानुनी भएको उल्लेख गर्दै नेपाली काङ्ग्रेसका सभापति शेरबहादुर देउवालाई २८ घण्टाभित्र प्रधानमन्त्री नियुक्त गर्न आदेश दिएको थियो।\nप्रधानमन्त्रीबाट हटेपछि, २०७८ मङ्सिर १० मा, चितवनमा भएको नेकपा एमालेको दशौँ राष्ट्रिय महाधिवेशनमा उनी अध्यक्षमा पुन:निर्वाचित भएका थिएँ। जेन–जीको आन्दोलन नियन्त्रण बाहिर पुगेपछि राजनीतिक निकासका लागि प्रधानमन्त्री केपी शर्मा ओलीले २०८२ भदौ २४ गते  राजीनामा दिएका हुन्।"
        },
        {
          "heading": "निर्वाचनको इतिहास",
          "content": "उनी नेकपा (एमाले)को तर्फबाट टिकट प्राप्त गर्दै प्रतिनिधि सभामा २०४८, २०५१, २०५६, र २०७४मा निर्वाचित भएका थिएँ। उनले आम निर्वाचन २०५६मा दुईवटा निर्वाचन क्षेत्रबाट चुनाव जितेका थिएँ। संविधानसभा निर्वाचन, २०६४मा उनले पराजय बेहोरेका थिएँ। यस तालिकामा शीर्ष प्रतिस्पर्धीहरू मात्र समेटिएको छ।"
        },
        {
          "heading": "आम निर्वाचन २०४८",
          "content": ""
        },
        {
          "heading": "आम निर्वाचन २०५१",
          "content": ""
        },
        {
          "heading": "आम निर्वाचन २०५६",
          "content": ""
        },
        {
          "heading": "संविधानसभा निर्वाचन, २०६४",
          "content": ""
        },
        {
          "heading": "संविधानसभा निर्वाचन २०७०",
          "content": ""
        },
        {
          "heading": "२०७२ को संसदीय प्रधानमन्त्री पदको निर्वाचन",
          "content": ""
        },
        {
          "heading": "प्रतिनिधिसभा निर्वाचन, २०७४",
          "content": ""
        },
        {
          "heading": "व्यक्तिगत जीवन",
          "content": "जेलबाट छुटेपछि ओलीको राधिका शाक्यसँग विवाह गरेका थिएँ। उनीहरूको पहिलो भेट पार्टीका एक कार्यक्रममा भएको थियो।"
        },
        {
          "heading": "स्वास्थ समस्य",
          "content": "ओलीले दुई पटक मिर्गौला प्रत्यारोपण गरेका छन्। पहिलो पटक २०६३ मा नयाँ दिल्लीको अपोलो अस्पतालमा प्रत्यारोपण गरिएको थियो।  २०७६ सालमा त्रिभुवन विश्वविद्यालय शिक्षण अस्पताल, काठमाडौँमा दोस्रो पटक उनको मृगौला प्रत्यारोपण गरिएको थियो। दोस्रो प्रत्यारोपणका लागि उनले ३२ वर्षीया समिक्षा सङ्ग्रौलाबाट मिर्गौला पाएका थिएँ। समिक्षा सङ्गौला ओलीको भान्जी रहेको जनाइएको थियो। २०६३ मा मृगौला प्रत्यारोपण गरेका नयाँ दिल्लीका एक वरिष्ठ प्रत्यारोपण चिकित्सक पनि काठमाडौँमा यस प्रक्रियालाई सहयोग गर्न उपस्थित भएका थिएँ।"
        },
        {
          "heading": "विवादास्पद दावीहरू",
          "content": "केपी शर्मा ओलीले विभिन्न कार्यक्रमहरूमा विवादास्पद दावी तथा टीकाटिप्पणी गरेका छन्। उनले आफ्ना भनाइहरूमा विभिन्न किसिमका उखान टुक्काको पनि प्रयोग गर्ने गरेका छन्। यस्ता केही दावीहरूले दोहोर अर्थ दिनुका साथै आलोचना पनि भएको थियो। उनका केही विवादास्पद दाबीहरू यस प्रकार छन्:\n१) सुपर कम्प्युटर, माघ २०७५: ओलीले नेपालले निर्माण गरिरहेको सुपरकम्प्युटर देखेर संसार नै चकित भएको दावी गरेका थिएँ। उनले बनेपा आइटी पार्कमा निर्माण भइरहेको कम्प्युटरलाई सङ्केत गर्दै आएका थिएँ। कम्पुटिङ पावरको कमी भए पनि निर्माताहरूले सुपर कम्प्युटर भएको दावी गरेका छन्।\n२) गैँडा र सगरमाथा, भदौ २०७६: ओलीले गैँडाको लागि प्रयोग गरिने अङ्ग्रेजी शब्द राइनो र सगरमाथालाई जनाउने माउन्ट एभरेस्टलाई नेपाली शब्द गैँडा र सगरमाथा प्रयोग गर्नुपर्ने बताएका थिएँ।\n३) भारतीय कोरोनाभाइरस, २०७७ बैशाख : नेपालमा कोभिड–१९ महामारीका बेला ओलीले 'चिनियाँ वा इटालेेेली भाइरस' भन्दा पनि 'भारतीय भाइरस' बढी खतरनाक भएको भन्दै आक्रोश पोखेका थिएँ। उनले यो कुरा संसदलाई सम्बोधन गर्दै गर्दा भनेका थिएँ जहाँ उनले राष्ट्रव्यापी बन्दाबन्दी उल्लङ्घन गर्ने व्यक्तिहरूमा कोरोनाभाइरसको बढ्दो सङ्ख्यालाई दोषी ठहर्‍याएका थिएँ। उनले विशेष गरी भारतबाट नेपालमा सुटुक्क छिर्नेहरूलाई निसाना बनाएका थिएँ। भारतबाट अवैध माध्यमबाट आउने मानिसहरूले देशमा भाइरस फैलाउँदैछन् भनेर दावी गरेका थिएँ जसले गर्दा भारतका सञ्चार माध्यमहरूको ध्यानाकर्षण गरेको थियो।\n३) हाच्छ्युँ सम्बन्धित भनाइ, २०७७ असार : राष्ट्रियसभालाई सम्बोधन गर्दै ओलीले कोरोना ज्वरोजस्तै हो, यदि यो रोग लाग्यो भने, कसैले हाच्छ्युँ गर्ने र तातोपानी र बेसार सेवन गरेर भाइरसलाई धपाउनुपर्ने दावी गरेका थिएँ जसले\nराष्ट्रिय सञ्चार माध्यम र सामाजिक सञ्जालमा बहस उत्पन्न गरेको थियो। उनले लसुन र बेसारले कोरोनाभाइरस विरुद्ध लड्न रोग प्रतिरोधात्मक प्रणालीलाई बढाउन मदत गर्ने बताएका थिएँ।\n४) भगवान राम एक नेपाली हुन् भन्ने भनाइ:  असार २०७७: कवि भानुभक्त आचार्यको २०७औँ जन्म जयन्ती मनाउने कार्यलाई सम्बोधन गर्दै ओलीले भगवान रामको जन्म नेपालमा भएको दावी गरेका थिएँ  भने उनले भारतले नक्कली अयोध्या सिर्जना गरेको बताएका थिएँ। उनले दक्षिण नेपालको ठोरीलाई रामको जन्मस्थल भएको दावी गरेका थिएँ भने भारतको अयोध्याबाट सीतासँग विवाह गर्न पूर्वी नेपालको जनकपुर पुग्नु रामका लागि असम्भव रहेको बताएका थिएँ। पछि उनले यस विषयमा छानबिन गर्न आदेश दिएका थिएँ। उनले त्यस क्षेत्रका अधिकारीहरूलाई अयोध्यापुरी कहाँ छ भन्ने विषयमा अध्ययन गर्न आग्रह गरेका थिएँ। उनले वास्तविक अयोध्याको बलियो प्रमाण पनि भेट्टाएको दावी गरेका थिएँ। यसमा सोमेश्वर गढी र वाल्मीकि आश्रमका भग्नावशेषहरू पनि समावेश भएको र यी दुवै भगवान रामसँग सम्बन्धित रहेको उनले बताएका थिएँ।\n५) योगको उत्पत्ति नेपाल: असार २०७७ मा, ओलीले योगको उत्पत्ति नेपालबाट भएको दावी गरेका थिएँ। २०७८ असार ७ मा अन्तर्राष्ट्रिय योग दिवसको अवसरमा ओलीले योगको उत्पत्ति उत्तराखण्ड र विशेष गरी नेपालमा भएको दावी गरेका थिएँ। उनका अनुसार योग विज्ञानको स्थापना भएको समयमा भारत एक देशको रूपमा अस्तित्वमा थिएँन। यसले गर्दा नेपाली र भारतीय सामाजिक सञ्जालहरूबाट एकपछि अर्को प्रतिक्रिया प्राप्त भएको थियो।"
        },
        {
          "heading": "सन्दर्भ सामग्रीहरू",
          "content": ""
        },
        {
          "heading": "बाह्य कडीहरू",
          "content": "नेकपा एमालेको आधिकारिक वेबसाइट   वेब्याक मेसिन अभिलेखिकरण २००६-०१-१० मिति"
        }
      ],
      "language": "ne",
      "content_length": 12665,
      "link_count": 50,
      "image_count": 4,
      "matched_via_search": true,
      "original_search": "KP Oli"
    }
  },
  "metadata": {
    "found_languages": [
      "en",
      "ne"
    ],
    "search_results": [],
    "disambiguation": false
  }
}